       IDENTIFICATION DIVISION.
       program-id. AMBE000.
       AUTHOR. GUALBERTO.
      ******************************************************************* 
      *DATA.....:  20/07/2019.
      *FUNCAO...:  TELA DE ACESSO AOS PROGRAMAS 
      *******************************************************************
       
       ENVIRONMENT DIVISION.
       